import React from 'react';
import './BackButton.css'

interface BackButtonProps {
    onClick: () => void;
  }

  export const BackButton: React.FC<BackButtonProps> = ({ onClick }) => {
    return (
      <button onClick={onClick} className="back-button">
        {/* &lsaquo;   */}
        {/* Стрелочка назад */}
        <svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="41" height="41" rx="10" fill="black" fill-opacity="0.02"/>
<rect x="0.5" y="0.5" width="40" height="40" rx="9.5" stroke="black" stroke-opacity="0.1"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M22.5 14.3335C22.5768 14.2539 22.6688 14.1904 22.7705 14.1468C22.8721 14.1031 22.9815 14.0801 23.0921 14.0791C23.2028 14.0782 23.3125 14.0993 23.4149 14.1412C23.5173 14.1831 23.6104 14.2449 23.6886 14.3232C23.7669 14.4014 23.8287 14.4945 23.8706 14.5969C23.9125 14.6993 23.9336 14.809 23.9327 14.9197C23.9317 15.0303 23.9087 15.1397 23.865 15.2413C23.8214 15.343 23.7579 15.435 23.6783 15.5118L18.7791 20.411C18.6229 20.5673 18.5351 20.7792 18.5351 21.0002C18.5351 21.2211 18.6229 21.4331 18.7791 21.5893L23.6791 26.4885C23.8354 26.6449 23.9231 26.8569 23.923 27.078C23.923 27.299 23.8351 27.511 23.6787 27.6673C23.5223 27.8235 23.3103 27.9113 23.0892 27.9112C22.8682 27.9111 22.6562 27.8232 22.5 27.6668L16.4225 21.5893C16.2662 21.4331 16.1785 21.2211 16.1785 21.0002C16.1785 20.7792 16.2662 20.5673 16.4225 20.411L22.5 14.3335Z" fill="black"/>
</svg>
      </button>
    );
  };

